felixfelix-bot/balloon-fresh/tracker/firmware/main/rx_test/sdkconfig.defaults
# P1.2 RX test firmware - baseline defaults (RX-only bench firmware).
# Target: ESP32-C3_Mini_V1 dev board.

CONFIG_IDF_TARGET="esp32c3"

CONFIG_ESP_SYSTEM_DEFAULT_CPU_FREQ_80=y
CONFIG_ESP_SYSTEM_DEFAULT_CPU_FREQ=80

CONFIG_FREERTOS_HZ=1000

# SPI ISR in IRAM so the DIO9 packet-received interrupt is serviced promptly.
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# Console on the dev board's USB-C port (USB Serial JTAG).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
